Revit 2027 API
HVACLoadConstructionClass Enumeration
 Enumerated type listing options for construction class for HVAC analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HVACLoadConstructionClass
Public Enumeration HVACLoadConstructionClass
public enum class HVACLoadConstructionClass
type HVACLoadConstructionClass
Members
Member name | Value | Description
LooseConstruction | 0 |  A loose construction has an infiltration level of approximately 0.076 cfm/sqft
MediumConstruction | 1 |  A medium construction has an infiltration level of approximately 0.038 cfm/sqft
NoneConstruction | 3 |  A none construction has an infiltration level of 0 cfm/sqft
TightConstruction | 2 |  A tight construction has an infiltration level of approximately 0.019 cfm/sqft
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace